import math


def main(y, z, x):
    result = 0
    n = len(x)
    for i in range(1, n + 1):
        inner_sum = (67 * (z[i - 1] ** 3)
                     + 94 * (x[math.ceil(i / 3 - 1)] ** 2)
                     + y[i - 1]) ** 4
        result += inner_sum
    result *= 40
    return result


# Данные векторы
x = [0.66, 0.69, 0.67, 0.31, 0.13, 0.7]
y = [-0.95, 0.31, 0.57, 0.2, 0.11, -0.57]
z = [-0.3, -0.09, 0.27, 0.22, -0.53, 0.48]

# Вызов функции и вывод результата
result = main([0.66, 0.69, 0.67, 0.31, 0.13, 0.7],
              [-0.95, 0.31, 0.57, 0.2, 0.11, -0.57],
              [-0.3, -0.09, 0.27, 0.22, -0.53, 0.48])
print("Результат f(x, y, z) ≈ {:.2e}".format(result))
