def main(x):
    dict0 = {1976: 0, 1975: 1, 1971: 2}
    dict0_down = {1976: 4, 1975: 5, 1971: 6}
    dict1 = {2017: 8, 1980: 9, 2019: 10}
    dict1_U_r = {2017: dict0[x[0]], 1980: 3, 2019: dict0_down[x[0]]}
    dict0_U_l = {1976: 7, 1975: dict1[x[1]], 1971: 11}
    dict3 = {1981: dict1_U_r[x[1]], 2015: dict0_U_l[x[0]]}
    dict2 = {1986: dict3[x[3]], 1991: 12, 2015: 13}
    return dict2[x[2]]


# Примеры использования
print(main([1971, 2019, 2015, 1981, 'VALA']))  # Ожидаемый результат: 13
print(main([1975, 1980, 1991, 1981, 'URWEB']))  # Ожидаемый результат: 12
print(main([1975, 2019, 1986, 1981, 'URWEB']))  # Ожидаемый результат: 5
print(main([1971, 2019, 1986, 1981, 'URWEB']))  # Ожидаемый результат: 6
print(main([1975, 1980, 1986, 1981, 'URWEB']))  # Ожидаемый результат: 3
